w4d3/RentCatAuth/skeleton/app/views/cats/_req_tr.html.erb

<tr>
  <td><%= User.find_by(id: req.user_id).user_name %></td>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]