w4d1/routes/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email") VALUES (?, ?)  [["name", "David"], ["email", "d@app"]]
---
  def create
    user = User.new(user_params)
    if user.save