w4d3/RentCatAuth/skeleton/app/controllers/cat_rental_requests_controller.rb

INSERT INTO "cat_rental_requests" ("cat_id", "end_date", "start_date", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["cat_id", 1], ["end_date", "2017-06-25"], ["start_date", "2017-06-22"], ["status", "PENDING"], ["created_at", "2017-06-21 20:44:44.413864"], ["updated_at", "2017-06-21 20:44:44.413864"]]
---
  def create
    @rental_request = CatRentalRequest.new(cat_rental_request_params)
    @rental_request.user_id = current_user.id
    if @rental_request.save