w4d3/RentCatAuth/skeleton/app/controllers/cats_controller.rb

INSERT INTO "cats" ("birth_date", "color", "description", "name", "sex", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @cat = Cat.new(cat_params)
    @cat.user_id = current_user.id
    if @cat.save

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "cats" SET "birth_date" = $1, "color" = $2, "description" = $3, "name" = $4, "updated_at" = $5 WHERE "cats"."id" = $6  [["birth_date", "2014-04-01"], ["color", "black"], ["description", "I have fluffy paws"], ["name", "Mr.Fluffy Paws"], ["updated_at", "2017-06-21 23:09:54.509817"], ["id", 2]]
---
  def update
    @cat = Cat.find(params[:id])
    if @cat.update_attributes(cat_params)